result_100.txt
dennisfleischmann@Denniss-MacBook-Pro infineon % ab -n 1000 -c 10 -r http://localhost/hwvywrwrox

This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Apache/2.4.57
Server Hostname:        localhost
Server Port:            80

Document Path:          /hwvywrwrox
Document Length:        245 bytes

Concurrency Level:      10
Time taken for tests:   0.524 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      480000 bytes
HTML transferred:       245000 bytes
Requests per second:    1907.39 [#/sec] (mean)
Time per request:       5.243 [ms] (mean)
Time per request:       0.524 [ms] (mean, across all concurrent requests)
Transfer rate:          894.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     2    5   1.2      5      13
Waiting:        2    5   1.2      5      13
Total:          2    5   1.2      5      13

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      6
  80%      6
  90%      7
  95%      7
  98%      8
  99%      8
 100%     13 (longest request)